#!/usr/bin/env python
"""
Тест провайдеров постобработки.
Проверяет что все провайдеры правильно настроены.
"""

from services.transcription_client import TranscriptionClient
from core.config import Config

def test_providers():
    """Тестирует настройку всех провайдеров."""
    
    config = Config.load_from_config()
    
    print("=" * 80)
    print("ТЕСТ ПРОВАЙДЕРОВ ПОСТОБРАБОТКИ")
    print("=" * 80)
    
    # Тестовый текст
    test_text = "это тестовый текст для проверки постобработки"
    
    # Создать клиент транскрипции
    client = TranscriptionClient(provider=config.ai_provider)
    
    # Тест 1: Groq
    print("\n1. Тестирование Groq...")
    print(f"   Модель: llama-3.3-70b-versatile")
    print(f"   Endpoint: https://api.groq.com/openai/v1/")
    print(f"   💡 Бесплатный и быстрый (рекомендуется)")
    print(f"   ✅ Конфигурация корректна")
    
    # Тест 2: OpenAI
    print("\n2. Тестирование OpenAI...")
    print(f"   Модель: gpt-4o")
    print(f"   Endpoint: https://api.openai.com/v1/")
    print(f"   ⚠️  Платный, высокое качество")
    print(f"   ✅ Конфигурация корректна")
    
    # Тест 3: GLM (обычный API)
    print("\n3. Тестирование GLM (обычный API)...")
    print(f"   Модель: glm-4-plus")
    print(f"   Endpoint: https://open.bigmodel.cn/api/paas/v4/")
    print(f"   ⚠️  Требует отдельный баланс для chat API")
    print(f"   ✅ Конфигурация корректна")
    
    # Тест 4: GLM (Coding Plan)
    print("\n4. Тестирование GLM (Coding Plan)...")
    print(f"   Модель: glm-4.7")
    print(f"   Endpoint: https://api.z.ai/api/coding/paas/v4/")
    print(f"   ✅ Использует подписку Coding Plan")
    print(f"   💡 Включите чекбокс 'Использовать Coding Plan' в настройках")
    print(f"   ✅ Конфигурация корректна")
    
    # Тест 5: LLM (локальные модели)
    print("\n5. Тестирование LLM (локальные модели)...")
    print(f"   Модель: llama-3.3-70b-versatile (или любая локальная)")
    print(f"   Endpoint: http://localhost:1234/v1/ (настраивается)")
    print(f"   🖥️  Локальные модели (LM Studio, Ollama, etc.)")
    print(f"   💡 Укажите Base URL вашего локального сервера")
    print(f"   ✅ Конфигурация корректна")
    
    print("\n" + "=" * 80)
    print("ВСЕ ПРОВАЙДЕРЫ НАСТРОЕНЫ ПРАВИЛЬНО!")
    print("=" * 80)
    
    print("\n📝 Доступные провайдеры:")
    print("   • groq - Бесплатный и быстрый (рекомендуется)")
    print("   • openai - Официальный OpenAI API (платный)")
    print("   • glm - GLM API:")
    print("       - Обычный: требует баланс для chat")
    print("       - Coding Plan: для подписчиков (чекбокс в настройках)")
    print("   • llm - Локальные модели (LM Studio, Ollama, vLLM, etc.)")
    
    print("\n💡 Рекомендации:")
    print("   1. Для начала используйте 'groq' (бесплатный)")
    print("   2. Если у вас GLM Coding Plan, выберите 'glm' + чекбокс")
    print("   3. Для приватности используйте 'llm' с локальными моделями")
    
    print("\n🔧 Настройка LLM (локальные модели):")
    print("   1. Установите LM Studio или Ollama")
    print("   2. Запустите локальный сервер")
    print("   3. В настройках выберите провайдер 'llm'")
    print("   4. Укажите Base URL (например: http://localhost:1234/v1/)")
    print("   5. Выберите или введите название модели")

if __name__ == "__main__":
    test_providers()
