"""
Тест для проверки поля кастомной модели в настройках постобработки.
"""
import sys
from PyQt6.QtWidgets import QApplication
from core.config import Config
from ui.settings_window import SettingsWindow


def test_custom_model_field():
    """Тест проверяет что поле кастомной модели отображается и работает."""
    app = QApplication(sys.argv)
    
    # Загрузить конфигурацию из config.jsonc
    config = Config.load_from_config()
    
    # Создать окно настроек
    settings_window = SettingsWindow(config)
    
    # Проверить что поле кастомной модели существует
    assert hasattr(settings_window, 'post_processing_custom_model_edit'), \
        "Поле кастомной модели не найдено"
    
    # Проверить что метка существует
    assert hasattr(settings_window, 'post_processing_custom_model_label'), \
        "Метка кастомной модели не найдена"
    
    # Установить значение в поле
    test_model = "gpt-4-turbo-preview"
    settings_window.post_processing_custom_model_edit.setText(test_model)
    
    # Проверить что значение установлено
    assert settings_window.post_processing_custom_model_edit.text() == test_model, \
        f"Значение не установлено: {settings_window.post_processing_custom_model_edit.text()}"
    
    # Проверить что поле включено/выключено вместе с постобработкой
    settings_window.enable_post_processing_check.setChecked(True)
    assert settings_window.post_processing_custom_model_edit.isEnabled(), \
        "Поле должно быть включено когда постобработка включена"
    
    settings_window.enable_post_processing_check.setChecked(False)
    assert not settings_window.post_processing_custom_model_edit.isEnabled(), \
        "Поле должно быть выключено когда постобработка выключена"
    
    print("✅ Все проверки пройдены!")
    print(f"   - Поле кастомной модели существует")
    print(f"   - Метка существует")
    print(f"   - Значение устанавливается корректно")
    print(f"   - Поле включается/выключается вместе с постобработкой")
    
    # Показать окно для визуальной проверки
    settings_window.show()
    
    # Переключиться на страницу постобработки (индекс 3)
    settings_window.sidebar.setCurrentRow(3)
    
    print("\n📋 Инструкции для ручной проверки:")
    print("   1. Откройте страницу 'Обработка' (должна быть уже открыта)")
    print("   2. Включите 'Включить дополнительную обработку текста'")
    print("   3. Выберите любой провайдер (groq, openai, glm, llm)")
    print("   4. Проверьте что поле 'Кастомная модель' отображается")
    print("   5. Введите название модели (например: gpt-4-turbo-preview)")
    print("   6. Нажмите 'Сохранить'")
    print("   7. Закройте окно и проверьте .env файл")
    
    sys.exit(app.exec())


if __name__ == "__main__":
    test_custom_model_field()
